@bryantbiggs 
I don't have a duplicate rule in the module config. Maybe duplicates are creating when it tries to remove a rule and at the same time it creates new one and because these operations happen at the same time it fails ? I would say that editing rules works unstable. I could reproduce the issue using another set of rules. Please review my reproduction below. What I'm doing wrong? Thanks in advance

<details><summary>initial config</summary>

``` hcl
    "test-sg" = {
      name        = "test-sg"
      description = "TEST SG REMOVE ME AFTER TEST"
      revoke_rules_on_delete = true
      ingress_rules     = ["http-80-tcp", "http-8080-tcp"]
      ingress_cidr_blocks = ["0.0.0.0/0"]
      ingress_with_cidr_blocks = [
        { from_port = 1935, to_port = 1935, protocol = "tcp", cidr_blocks = "0.0.0.0/0", description = "RTMP" },
        { from_port = 5443, to_port = 5443, protocol = "tcp", cidr_blocks = "0.0.0.0/0", description = "TLS" },
        { from_port = 5066, to_port = 5066, protocol = "tcp", cidr_blocks = "0.0.0.0/0" },
        { from_port = 50000, to_port = 60000, protocol = "udp", cidr_blocks = "0.0.0.0/0", description = "RTP media" },
        { from_port = 5000, to_port = 5000, protocol = "tcp", cidr_blocks = dependency.vpc.outputs.vpc_cidr_block, description = "App 5000" },
        { from_port = 5001, to_port = 5001, protocol = "tcp", cidr_blocks = dependency.vpc.outputs.vpc_cidr_block, description = "App 5001" },
        { from_port = 5060, to_port = 5060, protocol = "tcp", cidr_blocks = dependency.vpc.outputs.vpc_cidr_block, description = "SIP" },
        { from_port = 5080, to_port = 5080, protocol = "tcp", cidr_blocks = dependency.vpc.outputs.vpc_cidr_block, description = "App 5080" },
        { from_port = 9100, to_port = 9100, protocol = "tcp", cidr_blocks = dependency.vpc.outputs.vpc_cidr_block, description = "Node Exporter" }, 
      ]
    }
```
</details>

<details><summary>Creation (All Good)</summary>

``` hcl
15:47:30.505 STDOUT tofu: OpenTofu used the selected providers to generate the following execution
15:47:30.505 STDOUT tofu: plan. Resource actions are indicated with the following symbols:
15:47:30.505 STDOUT tofu:   + create
15:47:30.505 STDOUT tofu: OpenTofu will perform the following actions:
15:47:30.505 STDOUT tofu:   # module.wrapper["test-sg"].aws_security_group.this_name_prefix[0] will be created
15:47:30.505 STDOUT tofu:   + resource "aws_security_group" "this_name_prefix" {
15:47:30.505 STDOUT tofu:       + arn                    = (known after apply)
15:47:30.505 STDOUT tofu:       + description            = "TEST SG REMOVE ME AFTER TEST"
15:47:30.505 STDOUT tofu:       + egress                 = (known after apply)
15:47:30.505 STDOUT tofu:       + id                     = (known after apply)
15:47:30.505 STDOUT tofu:       + ingress                = (known after apply)
15:47:30.505 STDOUT tofu:       + name                   = (known after apply)
15:47:30.505 STDOUT tofu:       + name_prefix            = "test-sg-"
15:47:30.505 STDOUT tofu:       + owner_id               = (known after apply)
15:47:30.505 STDOUT tofu:       + region                 = "eu-central-1"
15:47:30.505 STDOUT tofu:       + revoke_rules_on_delete = true
15:47:30.505 STDOUT tofu:       + tags                   = {
15:47:30.505 STDOUT tofu:           + "Environment"     = "DEV"
15:47:30.505 STDOUT tofu:           + "Name"            = "test-sg"
15:47:30.505 STDOUT tofu:           + "Owner"           = "xxxx"
15:47:30.505 STDOUT tofu:           + "Owner_Name"      = "xxxxx"
15:47:30.505 STDOUT tofu:           + "xxx_Project" = "xxx"
15:47:30.505 STDOUT tofu:           + "Terragrunt_Unit" = "xxxx/eu-central-1/projects/xxxx/dev/sg"
15:47:30.506 STDOUT tofu:         }
15:47:30.506 STDOUT tofu:       + tags_all               = {
15:47:30.506 STDOUT tofu:           + "Environment"          = "DEV"
15:47:30.506 STDOUT tofu:           + "GitLab_Group"         = "Infrastructure-As-Code"
15:47:30.506 STDOUT tofu:           + "GitLab_Project"       = "xxxx-terraform-live"
15:47:30.506 STDOUT tofu:           + "Managed_By_Terraform" = "true"
15:47:30.506 STDOUT tofu:           + "Name"                 = "test-sg"
15:47:30.506 STDOUT tofu:           + "Owner"                = "xxxx"
15:47:30.506 STDOUT tofu:           + "Owner_Name"           = "xxx"
15:47:30.506 STDOUT tofu:           + "xxx_Project"      = "xxx"
15:47:30.506 STDOUT tofu:           + "Terragrunt_Unit"      = "xxxxx/eu-central-1/projects/xxxx/dev/sg"
15:47:30.506 STDOUT tofu:         }
15:47:30.506 STDOUT tofu:       + vpc_id                 = "vpc-xxxxxx"
15:47:30.506 STDOUT tofu:       + timeouts {
15:47:30.506 STDOUT tofu:           + create = "10m"
15:47:30.506 STDOUT tofu:           + delete = "15m"
15:47:30.506 STDOUT tofu:         }
15:47:30.506 STDOUT tofu:     }
15:47:30.506 STDOUT tofu:   # module.wrapper["test-sg"].aws_security_group_rule.ingress_rules[0] will be created
15:47:30.506 STDOUT tofu:   + resource "aws_security_group_rule" "ingress_rules" {
15:47:30.506 STDOUT tofu:       + cidr_blocks              = [
15:47:30.506 STDOUT tofu:           + "0.0.0.0/0",
15:47:30.506 STDOUT tofu:         ]
15:47:30.506 STDOUT tofu:       + description              = "HTTP"
15:47:30.506 STDOUT tofu:       + from_port                = 80
15:47:30.506 STDOUT tofu:       + id                       = (known after apply)
15:47:30.506 STDOUT tofu:       + ipv6_cidr_blocks         = []
15:47:30.506 STDOUT tofu:       + prefix_list_ids          = []
15:47:30.506 STDOUT tofu:       + protocol                 = "tcp"
15:47:30.506 STDOUT tofu:       + region                   = "eu-central-1"
15:47:30.506 STDOUT tofu:       + security_group_id        = (known after apply)
15:47:30.506 STDOUT tofu:       + security_group_rule_id   = (known after apply)
15:47:30.506 STDOUT tofu:       + self                     = false
15:47:30.506 STDOUT tofu:       + source_security_group_id = (known after apply)
15:47:30.506 STDOUT tofu:       + to_port                  = 80
15:47:30.506 STDOUT tofu:       + type                     = "ingress"
15:47:30.506 STDOUT tofu:     }
15:47:30.506 STDOUT tofu:   # module.wrapper["test-sg"].aws_security_group_rule.ingress_rules[1] will be created
15:47:30.506 STDOUT tofu:   + resource "aws_security_group_rule" "ingress_rules" {
15:47:30.506 STDOUT tofu:       + cidr_blocks              = [
15:47:30.506 STDOUT tofu:           + "0.0.0.0/0",
15:47:30.506 STDOUT tofu:         ]
15:47:30.506 STDOUT tofu:       + description              = "HTTP"
15:47:30.506 STDOUT tofu:       + from_port                = 8080
15:47:30.506 STDOUT tofu:       + id                       = (known after apply)
15:47:30.506 STDOUT tofu:       + ipv6_cidr_blocks         = []
15:47:30.506 STDOUT tofu:       + prefix_list_ids          = []
15:47:30.506 STDOUT tofu:       + protocol                 = "tcp"
15:47:30.506 STDOUT tofu:       + region                   = "eu-central-1"
15:47:30.506 STDOUT tofu:       + security_group_id        = (known after apply)
15:47:30.507 STDOUT tofu:       + security_group_rule_id   = (known after apply)
15:47:30.507 STDOUT tofu:       + self                     = false
15:47:30.507 STDOUT tofu:       + source_security_group_id = (known after apply)
15:47:30.507 STDOUT tofu:       + to_port                  = 8080
15:47:30.507 STDOUT tofu:       + type                     = "ingress"
15:47:30.507 STDOUT tofu:     }
15:47:30.507 STDOUT tofu:   # module.wrapper["test-sg"].aws_security_group_rule.ingress_with_cidr_blocks[0] will be created
15:47:30.507 STDOUT tofu:   + resource "aws_security_group_rule" "ingress_with_cidr_blocks" {
15:47:30.507 STDOUT tofu:       + cidr_blocks              = [
15:47:30.507 STDOUT tofu:           + "0.0.0.0/0",
15:47:30.507 STDOUT tofu:         ]
15:47:30.507 STDOUT tofu:       + description              = "RTMP"
15:47:30.507 STDOUT tofu:       + from_port                = 1935
15:47:30.507 STDOUT tofu:       + id                       = (known after apply)
15:47:30.507 STDOUT tofu:       + protocol                 = "tcp"
15:47:30.507 STDOUT tofu:       + region                   = "eu-central-1"
15:47:30.507 STDOUT tofu:       + security_group_id        = (known after apply)
15:47:30.507 STDOUT tofu:       + security_group_rule_id   = (known after apply)
15:47:30.507 STDOUT tofu:       + self                     = false
15:47:30.507 STDOUT tofu:       + source_security_group_id = (known after apply)
15:47:30.507 STDOUT tofu:       + to_port                  = 1935
15:47:30.507 STDOUT tofu:       + type                     = "ingress"
15:47:30.507 STDOUT tofu:     }
15:47:30.507 STDOUT tofu:   # module.wrapper["test-sg"].aws_security_group_rule.ingress_with_cidr_blocks[1] will be created
15:47:30.507 STDOUT tofu:   + resource "aws_security_group_rule" "ingress_with_cidr_blocks" {
15:47:30.507 STDOUT tofu:       + cidr_blocks              = [
15:47:30.507 STDOUT tofu:           + "0.0.0.0/0",
15:47:30.507 STDOUT tofu:         ]
15:47:30.507 STDOUT tofu:       + description              = "TLS"
15:47:30.507 STDOUT tofu:       + from_port                = 5443
15:47:30.507 STDOUT tofu:       + id                       = (known after apply)
15:47:30.507 STDOUT tofu:       + protocol                 = "tcp"
15:47:30.507 STDOUT tofu:       + region                   = "eu-central-1"
15:47:30.507 STDOUT tofu:       + security_group_id        = (known after apply)
15:47:30.507 STDOUT tofu:       + security_group_rule_id   = (known after apply)
15:47:30.507 STDOUT tofu:       + self                     = false
15:47:30.507 STDOUT tofu:       + source_security_group_id = (known after apply)
15:47:30.507 STDOUT tofu:       + to_port                  = 5443
15:47:30.507 STDOUT tofu:       + type                     = "ingress"
15:47:30.507 STDOUT tofu:     }
15:47:30.507 STDOUT tofu:   # module.wrapper["test-sg"].aws_security_group_rule.ingress_with_cidr_blocks[2] will be created
15:47:30.507 STDOUT tofu:   + resource "aws_security_group_rule" "ingress_with_cidr_blocks" {
15:47:30.507 STDOUT tofu:       + cidr_blocks              = [
15:47:30.507 STDOUT tofu:           + "0.0.0.0/0",
15:47:30.507 STDOUT tofu:         ]
15:47:30.507 STDOUT tofu:       + description              = "Ingress Rule"
15:47:30.507 STDOUT tofu:       + from_port                = 5066
15:47:30.507 STDOUT tofu:       + id                       = (known after apply)
15:47:30.507 STDOUT tofu:       + protocol                 = "tcp"
15:47:30.507 STDOUT tofu:       + region                   = "eu-central-1"
15:47:30.508 STDOUT tofu:       + security_group_id        = (known after apply)
15:47:30.508 STDOUT tofu:       + security_group_rule_id   = (known after apply)
15:47:30.508 STDOUT tofu:       + self                     = false
15:47:30.508 STDOUT tofu:       + source_security_group_id = (known after apply)
15:47:30.508 STDOUT tofu:       + to_port                  = 5066
15:47:30.508 STDOUT tofu:       + type                     = "ingress"
15:47:30.508 STDOUT tofu:     }
15:47:30.508 STDOUT tofu:   # module.wrapper["test-sg"].aws_security_group_rule.ingress_with_cidr_blocks[3] will be created
15:47:30.508 STDOUT tofu:   + resource "aws_security_group_rule" "ingress_with_cidr_blocks" {
15:47:30.508 STDOUT tofu:       + cidr_blocks              = [
15:47:30.508 STDOUT tofu:           + "0.0.0.0/0",
15:47:30.508 STDOUT tofu:         ]
15:47:30.508 STDOUT tofu:       + description              = "RTP media"
15:47:30.508 STDOUT tofu:       + from_port                = 50000
15:47:30.508 STDOUT tofu:       + id                       = (known after apply)
15:47:30.508 STDOUT tofu:       + protocol                 = "udp"
15:47:30.508 STDOUT tofu:       + region                   = "eu-central-1"
15:47:30.508 STDOUT tofu:       + security_group_id        = (known after apply)
15:47:30.508 STDOUT tofu:       + security_group_rule_id   = (known after apply)
15:47:30.508 STDOUT tofu:       + self                     = false
15:47:30.508 STDOUT tofu:       + source_security_group_id = (known after apply)
15:47:30.508 STDOUT tofu:       + to_port                  = 60000
15:47:30.508 STDOUT tofu:       + type                     = "ingress"
15:47:30.508 STDOUT tofu:     }
15:47:30.508 STDOUT tofu:   # module.wrapper["test-sg"].aws_security_group_rule.ingress_with_cidr_blocks[4] will be created
15:47:30.508 STDOUT tofu:   + resource "aws_security_group_rule" "ingress_with_cidr_blocks" {
15:47:30.508 STDOUT tofu:       + cidr_blocks              = [
15:47:30.508 STDOUT tofu:           + "10.0.0.0/16",
15:47:30.508 STDOUT tofu:         ]
15:47:30.508 STDOUT tofu:       + description              = "App 5000"
15:47:30.508 STDOUT tofu:       + from_port                = 5000
15:47:30.508 STDOUT tofu:       + id                       = (known after apply)
15:47:30.508 STDOUT tofu:       + protocol                 = "tcp"
15:47:30.508 STDOUT tofu:       + region                   = "eu-central-1"
15:47:30.508 STDOUT tofu:       + security_group_id        = (known after apply)
15:47:30.508 STDOUT tofu:       + security_group_rule_id   = (known after apply)
15:47:30.508 STDOUT tofu:       + self                     = false
15:47:30.508 STDOUT tofu:       + source_security_group_id = (known after apply)
15:47:30.508 STDOUT tofu:       + to_port                  = 5000
15:47:30.508 STDOUT tofu:       + type                     = "ingress"
15:47:30.508 STDOUT tofu:     }
15:47:30.508 STDOUT tofu:   # module.wrapper["test-sg"].aws_security_group_rule.ingress_with_cidr_blocks[5] will be created
15:47:30.508 STDOUT tofu:   + resource "aws_security_group_rule" "ingress_with_cidr_blocks" {
15:47:30.508 STDOUT tofu:       + cidr_blocks              = [
15:47:30.508 STDOUT tofu:           + "10.0.0.0/16",
15:47:30.508 STDOUT tofu:         ]
15:47:30.508 STDOUT tofu:       + description              = "App 5001"
15:47:30.508 STDOUT tofu:       + from_port                = 5001
15:47:30.508 STDOUT tofu:       + id                       = (known after apply)
15:47:30.508 STDOUT tofu:       + protocol                 = "tcp"
15:47:30.508 STDOUT tofu:       + region                   = "eu-central-1"
15:47:30.508 STDOUT tofu:       + security_group_id        = (known after apply)
15:47:30.508 STDOUT tofu:       + security_group_rule_id   = (known after apply)
15:47:30.509 STDOUT tofu:       + self                     = false
15:47:30.509 STDOUT tofu:       + source_security_group_id = (known after apply)
15:47:30.509 STDOUT tofu:       + to_port                  = 5001
15:47:30.509 STDOUT tofu:       + type                     = "ingress"
15:47:30.509 STDOUT tofu:     }
15:47:30.509 STDOUT tofu:   # module.wrapper["test-sg"].aws_security_group_rule.ingress_with_cidr_blocks[6] will be created
15:47:30.509 STDOUT tofu:   + resource "aws_security_group_rule" "ingress_with_cidr_blocks" {
15:47:30.509 STDOUT tofu:       + cidr_blocks              = [
15:47:30.509 STDOUT tofu:           + "10.0.0.0/16",
15:47:30.509 STDOUT tofu:         ]
15:47:30.509 STDOUT tofu:       + description              = "SIP"
15:47:30.509 STDOUT tofu:       + from_port                = 5060
15:47:30.509 STDOUT tofu:       + id                       = (known after apply)
15:47:30.509 STDOUT tofu:       + protocol                 = "tcp"
15:47:30.509 STDOUT tofu:       + region                   = "eu-central-1"
15:47:30.509 STDOUT tofu:       + security_group_id        = (known after apply)
15:47:30.509 STDOUT tofu:       + security_group_rule_id   = (known after apply)
15:47:30.509 STDOUT tofu:       + self                     = false
15:47:30.509 STDOUT tofu:       + source_security_group_id = (known after apply)
15:47:30.509 STDOUT tofu:       + to_port                  = 5060
15:47:30.509 STDOUT tofu:       + type                     = "ingress"
15:47:30.509 STDOUT tofu:     }
15:47:30.509 STDOUT tofu:   # module.wrapper["test-sg"].aws_security_group_rule.ingress_with_cidr_blocks[7] will be created
15:47:30.509 STDOUT tofu:   + resource "aws_security_group_rule" "ingress_with_cidr_blocks" {
15:47:30.509 STDOUT tofu:       + cidr_blocks              = [
15:47:30.509 STDOUT tofu:           + "10.0.0.0/16",
15:47:30.509 STDOUT tofu:         ]
15:47:30.509 STDOUT tofu:       + description              = "App 5080"
15:47:30.509 STDOUT tofu:       + from_port                = 5080
15:47:30.509 STDOUT tofu:       + id                       = (known after apply)
15:47:30.509 STDOUT tofu:       + protocol                 = "tcp"
15:47:30.509 STDOUT tofu:       + region                   = "eu-central-1"
15:47:30.509 STDOUT tofu:       + security_group_id        = (known after apply)
15:47:30.509 STDOUT tofu:       + security_group_rule_id   = (known after apply)
15:47:30.509 STDOUT tofu:       + self                     = false
15:47:30.509 STDOUT tofu:       + source_security_group_id = (known after apply)
15:47:30.509 STDOUT tofu:       + to_port                  = 5080
15:47:30.509 STDOUT tofu:       + type                     = "ingress"
15:47:30.509 STDOUT tofu:     }
15:47:30.509 STDOUT tofu:   # module.wrapper["test-sg"].aws_security_group_rule.ingress_with_cidr_blocks[8] will be created
15:47:30.509 STDOUT tofu:   + resource "aws_security_group_rule" "ingress_with_cidr_blocks" {
15:47:30.509 STDOUT tofu:       + cidr_blocks              = [
15:47:30.509 STDOUT tofu:           + "10.0.0.0/16",
15:47:30.509 STDOUT tofu:         ]
15:47:30.509 STDOUT tofu:       + description              = "Node Exporter"
15:47:30.509 STDOUT tofu:       + from_port                = 9100
15:47:30.509 STDOUT tofu:       + id                       = (known after apply)
15:47:30.509 STDOUT tofu:       + protocol                 = "tcp"
15:47:30.509 STDOUT tofu:       + region                   = "eu-central-1"
15:47:30.509 STDOUT tofu:       + security_group_id        = (known after apply)
15:47:30.509 STDOUT tofu:       + security_group_rule_id   = (known after apply)
15:47:30.509 STDOUT tofu:       + self                     = false
15:47:30.509 STDOUT tofu:       + source_security_group_id = (known after apply)
15:47:30.510 STDOUT tofu:       + to_port                  = 9100
15:47:30.510 STDOUT tofu:       + type                     = "ingress"
15:47:30.510 STDOUT tofu:     }
15:47:30.510 STDOUT tofu: Plan: 12 to add, 0 to change, 0 to destroy.
15:47:30.510 STDOUT tofu: 
15:47:30.510 STDOUT tofu: Changes to Outputs:
15:47:30.510 STDOUT tofu:   ~ wrapper = {
15:47:30.510 STDOUT tofu:       + test-sg                         = {
15:47:30.510 STDOUT tofu:           + security_group_arn         = (known after apply)
15:47:30.510 STDOUT tofu:           + security_group_description = "TEST SG REMOVE ME AFTER TEST"
15:47:30.510 STDOUT tofu:           + security_group_id          = (known after apply)
15:47:30.510 STDOUT tofu:           + security_group_name        = (known after apply)
15:47:30.510 STDOUT tofu:           + security_group_owner_id    = (known after apply)
15:47:30.510 STDOUT tofu:           + security_group_vpc_id      = "vpc-xxx"
15:47:30.510 STDOUT tofu:         }
15:47:30.510 STDOUT tofu:         # (1 unchanged attribute hidden)
15:47:30.510 STDOUT tofu:     }
15:47:30.510 STDOUT tofu: 
15:47:30.510 STDOUT tofu: Do you want to perform these actions?
15:47:30.510 STDOUT tofu:   OpenTofu will perform the actions described above.
15:47:30.510 STDOUT tofu:   Only 'yes' will be accepted to approve.
15:47:30.510 STDOUT tofu:   Enter a value: 
yes
15:47:34.645 STDOUT tofu: module.wrapper["test-sg"].aws_security_group.this_name_prefix[0]: Creating...
15:47:36.034 STDOUT tofu: module.wrapper["test-sg"].aws_security_group.this_name_prefix[0]: Creation complete after 1s [id=sg-095d0eaa468da446d]
15:47:36.040 STDOUT tofu: module.wrapper["test-sg"].aws_security_group_rule.ingress_with_cidr_blocks[6]: Creating...
15:47:36.040 STDOUT tofu: module.wrapper["test-sg"].aws_security_group_rule.ingress_with_cidr_blocks[8]: Creating...
15:47:36.042 STDOUT tofu: module.wrapper["test-sg"].aws_security_group_rule.ingress_with_cidr_blocks[2]: Creating...
15:47:36.042 STDOUT tofu: module.wrapper["test-sg"].aws_security_group_rule.ingress_rules[1]: Creating...
15:47:36.042 STDOUT tofu: module.wrapper["test-sg"].aws_security_group_rule.ingress_with_cidr_blocks[7]: Creating...
15:47:36.042 STDOUT tofu: module.wrapper["test-sg"].aws_security_group_rule.ingress_with_cidr_blocks[3]: Creating...
15:47:36.042 STDOUT tofu: module.wrapper["test-sg"].aws_security_group_rule.ingress_with_cidr_blocks[1]: Creating...
15:47:36.042 STDOUT tofu: module.wrapper["test-sg"].aws_security_group_rule.ingress_with_cidr_blocks[5]: Creating...
15:47:36.042 STDOUT tofu: module.wrapper["test-sg"].aws_security_group_rule.ingress_with_cidr_blocks[4]: Creating...
15:47:36.042 STDOUT tofu: module.wrapper["test-sg"].aws_security_group_rule.ingress_with_cidr_blocks[0]: Creating...
15:47:36.361 STDOUT tofu: module.wrapper["test-sg"].aws_security_group_rule.ingress_with_cidr_blocks[2]: Creation complete after 0s [id=sgrule-723896223]
15:47:36.366 STDOUT tofu: module.wrapper["test-sg"].aws_security_group_rule.ingress_rules[0]: Creating...
15:47:36.710 STDOUT tofu: module.wrapper["test-sg"].aws_security_group_rule.ingress_rules[1]: Creation complete after 1s [id=sgrule-1385587500]
15:47:37.102 STDOUT tofu: module.wrapper["test-sg"].aws_security_group_rule.ingress_with_cidr_blocks[3]: Creation complete after 1s [id=sgrule-975564094]
15:47:37.543 STDOUT tofu: module.wrapper["test-sg"].aws_security_group_rule.ingress_with_cidr_blocks[6]: Creation complete after 2s [id=sgrule-3321342910]
15:47:37.885 STDOUT tofu: module.wrapper["test-sg"].aws_security_group_rule.ingress_with_cidr_blocks[7]: Creation complete after 2s [id=sgrule-293012376]
15:47:38.265 STDOUT tofu: module.wrapper["test-sg"].aws_security_group_rule.ingress_with_cidr_blocks[8]: Creation complete after 2s [id=sgrule-2474565874]
15:47:38.602 STDOUT tofu: module.wrapper["test-sg"].aws_security_group_rule.ingress_with_cidr_blocks[1]: Creation complete after 3s [id=sgrule-247681733]
15:47:38.954 STDOUT tofu: module.wrapper["test-sg"].aws_security_group_rule.ingress_with_cidr_blocks[5]: Creation complete after 3s [id=sgrule-3642470144]
15:47:39.305 STDOUT tofu: module.wrapper["test-sg"].aws_security_group_rule.ingress_with_cidr_blocks[0]: Creation complete after 3s [id=sgrule-2663506971]
15:47:39.648 STDOUT tofu: module.wrapper["test-sg"].aws_security_group_rule.ingress_with_cidr_blocks[4]: Creation complete after 4s [id=sgrule-820109638]
15:47:39.988 STDOUT tofu: module.wrapper["test-sg"].aws_security_group_rule.ingress_rules[0]: Creation complete after 4s [id=sgrule-1335933050]
15:47:40.439 STDOUT tofu: 
15:47:40.440 STDOUT tofu: Apply complete! Resources: 12 added, 0 changed, 0 destroyed.
```
</details>

<details><summary>1st change in config - changed order based on `cidr_blocks`</summary>

``` hcl
    "test-sg" = {
      name        = "test-sg"
      description = "TEST SG REMOVE ME AFTER TEST"
      revoke_rules_on_delete = true
      ingress_rules     = ["http-80-tcp", "http-8080-tcp"]
      ingress_cidr_blocks = ["0.0.0.0/0"]
      ingress_with_cidr_blocks = [
        { from_port = 5000, to_port = 5000, protocol = "tcp", cidr_blocks = dependency.vpc.outputs.vpc_cidr_block, description = "App 5000" },
        { from_port = 5001, to_port = 5001, protocol = "tcp", cidr_blocks = dependency.vpc.outputs.vpc_cidr_block, description = "App 5001" },
        { from_port = 5060, to_port = 5060, protocol = "tcp", cidr_blocks = dependency.vpc.outputs.vpc_cidr_block, description = "SIP" },
        { from_port = 5080, to_port = 5080, protocol = "tcp", cidr_blocks = dependency.vpc.outputs.vpc_cidr_block, description = "App 5080" },
        { from_port = 9100, to_port = 9100, protocol = "tcp", cidr_blocks = dependency.vpc.outputs.vpc_cidr_block, description = "Node Exporter" },         
        { from_port = 1935, to_port = 1935, protocol = "tcp", cidr_blocks = "0.0.0.0/0", description = "RTMP" },
        { from_port = 5443, to_port = 5443, protocol = "tcp", cidr_blocks = "0.0.0.0/0", description = "TLS" },
        { from_port = 5066, to_port = 5066, protocol = "tcp", cidr_blocks = "0.0.0.0/0" },
        { from_port = 50000, to_port = 60000, protocol = "udp", cidr_blocks = "0.0.0.0/0", description = "RTP media" },
      ]
    }
```
</details>

<details><summary>Applying and fail</summary>

``` hcl
15:50:07.218 STDOUT tofu: OpenTofu used the selected providers to generate the following execution
15:50:07.218 STDOUT tofu: plan. Resource actions are indicated with the following symbols:
15:50:07.218 STDOUT tofu: -/+ destroy and then create replacement
15:50:07.218 STDOUT tofu: OpenTofu will perform the following actions:
15:50:07.218 STDOUT tofu:   # module.wrapper["test-sg"].aws_security_group_rule.ingress_with_cidr_blocks[0] must be replaced
15:50:07.218 STDOUT tofu: -/+ resource "aws_security_group_rule" "ingress_with_cidr_blocks" {
15:50:07.218 STDOUT tofu:       ~ cidr_blocks              = [ # forces replacement
15:50:07.218 STDOUT tofu:           - "0.0.0.0/0",
15:50:07.218 STDOUT tofu:           + "10.0.0.0/16",
15:50:07.218 STDOUT tofu:         ]
15:50:07.218 STDOUT tofu:       ~ description              = "RTMP" -> "App 5000"
15:50:07.218 STDOUT tofu:       ~ from_port                = 1935 -> 5000 # forces replacement
15:50:07.218 STDOUT tofu:       ~ id                       = "sgrule-2663506971" -> (known after apply)
15:50:07.218 STDOUT tofu:       ~ security_group_rule_id   = "sgr-09fbf251e522bbf80" -> (known after apply)
15:50:07.218 STDOUT tofu:       + source_security_group_id = (known after apply)
15:50:07.218 STDOUT tofu:       ~ to_port                  = 1935 -> 5000 # forces replacement
15:50:07.218 STDOUT tofu:         # (5 unchanged attributes hidden)
15:50:07.218 STDOUT tofu:     }
15:50:07.218 STDOUT tofu:   # module.wrapper["test-sg"].aws_security_group_rule.ingress_with_cidr_blocks[1] must be replaced
15:50:07.218 STDOUT tofu: -/+ resource "aws_security_group_rule" "ingress_with_cidr_blocks" {
15:50:07.218 STDOUT tofu:       ~ cidr_blocks              = [ # forces replacement
15:50:07.218 STDOUT tofu:           - "0.0.0.0/0",
15:50:07.218 STDOUT tofu:           + "10.0.0.0/16",
15:50:07.218 STDOUT tofu:         ]
15:50:07.218 STDOUT tofu:       ~ description              = "TLS" -> "App 5001"
15:50:07.218 STDOUT tofu:       ~ from_port                = 5443 -> 5001 # forces replacement
15:50:07.219 STDOUT tofu:       ~ id                       = "sgrule-247681733" -> (known after apply)
15:50:07.219 STDOUT tofu:       ~ security_group_rule_id   = "sgr-03a02dec0faf7fd1a" -> (known after apply)
15:50:07.219 STDOUT tofu:       + source_security_group_id = (known after apply)
15:50:07.219 STDOUT tofu:       ~ to_port                  = 5443 -> 5001 # forces replacement
15:50:07.219 STDOUT tofu:         # (5 unchanged attributes hidden)
15:50:07.219 STDOUT tofu:     }
15:50:07.219 STDOUT tofu:   # module.wrapper["test-sg"].aws_security_group_rule.ingress_with_cidr_blocks[2] must be replaced
15:50:07.219 STDOUT tofu: -/+ resource "aws_security_group_rule" "ingress_with_cidr_blocks" {
15:50:07.219 STDOUT tofu:       ~ cidr_blocks              = [ # forces replacement
15:50:07.219 STDOUT tofu:           - "0.0.0.0/0",
15:50:07.219 STDOUT tofu:           + "10.0.0.0/16",
15:50:07.219 STDOUT tofu:         ]
15:50:07.219 STDOUT tofu:       ~ description              = "Ingress Rule" -> "SIP"
15:50:07.219 STDOUT tofu:       ~ from_port                = 5066 -> 5060 # forces replacement
15:50:07.219 STDOUT tofu:       ~ id                       = "sgrule-723896223" -> (known after apply)
15:50:07.219 STDOUT tofu:       ~ security_group_rule_id   = "sgr-0cfd519f9b8965c5d" -> (known after apply)
15:50:07.219 STDOUT tofu:       + source_security_group_id = (known after apply)
15:50:07.219 STDOUT tofu:       ~ to_port                  = 5066 -> 5060 # forces replacement
15:50:07.219 STDOUT tofu:         # (5 unchanged attributes hidden)
15:50:07.219 STDOUT tofu:     }
15:50:07.219 STDOUT tofu:   # module.wrapper["test-sg"].aws_security_group_rule.ingress_with_cidr_blocks[3] must be replaced
15:50:07.219 STDOUT tofu: -/+ resource "aws_security_group_rule" "ingress_with_cidr_blocks" {
15:50:07.219 STDOUT tofu:       ~ cidr_blocks              = [ # forces replacement
15:50:07.219 STDOUT tofu:           - "0.0.0.0/0",
15:50:07.219 STDOUT tofu:           + "10.0.0.0/16",
15:50:07.219 STDOUT tofu:         ]
15:50:07.219 STDOUT tofu:       ~ description              = "RTP media" -> "App 5080"
15:50:07.219 STDOUT tofu:       ~ from_port                = 50000 -> 5080 # forces replacement
15:50:07.219 STDOUT tofu:       ~ id                       = "sgrule-975564094" -> (known after apply)
15:50:07.219 STDOUT tofu:       ~ protocol                 = "udp" -> "tcp" # forces replacement
15:50:07.220 STDOUT tofu:       ~ security_group_rule_id   = "sgr-092ff617c87396f85" -> (known after apply)
15:50:07.220 STDOUT tofu:       + source_security_group_id = (known after apply)
15:50:07.220 STDOUT tofu:       ~ to_port                  = 60000 -> 5080 # forces replacement
15:50:07.220 STDOUT tofu:         # (4 unchanged attributes hidden)
15:50:07.220 STDOUT tofu:     }
15:50:07.220 STDOUT tofu:   # module.wrapper["test-sg"].aws_security_group_rule.ingress_with_cidr_blocks[4] must be replaced
15:50:07.220 STDOUT tofu: -/+ resource "aws_security_group_rule" "ingress_with_cidr_blocks" {
15:50:07.220 STDOUT tofu:       ~ description              = "App 5000" -> "Node Exporter"
15:50:07.220 STDOUT tofu:       ~ from_port                = 5000 -> 9100 # forces replacement
15:50:07.220 STDOUT tofu:       ~ id                       = "sgrule-820109638" -> (known after apply)
15:50:07.220 STDOUT tofu:       ~ security_group_rule_id   = "sgr-04383fd54cde6d7cf" -> (known after apply)
15:50:07.220 STDOUT tofu:       + source_security_group_id = (known after apply)
15:50:07.220 STDOUT tofu:       ~ to_port                  = 5000 -> 9100 # forces replacement
15:50:07.220 STDOUT tofu:         # (6 unchanged attributes hidden)
15:50:07.220 STDOUT tofu:     }
15:50:07.220 STDOUT tofu:   # module.wrapper["test-sg"].aws_security_group_rule.ingress_with_cidr_blocks[5] must be replaced
15:50:07.220 STDOUT tofu: -/+ resource "aws_security_group_rule" "ingress_with_cidr_blocks" {
15:50:07.220 STDOUT tofu:       ~ cidr_blocks              = [ # forces replacement
15:50:07.220 STDOUT tofu:           - "10.0.0.0/16",
15:50:07.220 STDOUT tofu:           + "0.0.0.0/0",
15:50:07.220 STDOUT tofu:         ]
15:50:07.220 STDOUT tofu:       ~ description              = "App 5001" -> "RTMP"
15:50:07.220 STDOUT tofu:       ~ from_port                = 5001 -> 1935 # forces replacement
15:50:07.220 STDOUT tofu:       ~ id                       = "sgrule-3642470144" -> (known after apply)
15:50:07.220 STDOUT tofu:       ~ security_group_rule_id   = "sgr-05b85502d2c7e5250" -> (known after apply)
15:50:07.221 STDOUT tofu:       + source_security_group_id = (known after apply)
15:50:07.221 STDOUT tofu:       ~ to_port                  = 5001 -> 1935 # forces replacement
15:50:07.221 STDOUT tofu:         # (5 unchanged attributes hidden)
15:50:07.221 STDOUT tofu:     }
15:50:07.221 STDOUT tofu:   # module.wrapper["test-sg"].aws_security_group_rule.ingress_with_cidr_blocks[6] must be replaced
15:50:07.221 STDOUT tofu: -/+ resource "aws_security_group_rule" "ingress_with_cidr_blocks" {
15:50:07.221 STDOUT tofu:       ~ cidr_blocks              = [ # forces replacement
15:50:07.221 STDOUT tofu:           - "10.0.0.0/16",
15:50:07.221 STDOUT tofu:           + "0.0.0.0/0",
15:50:07.221 STDOUT tofu:         ]
15:50:07.221 STDOUT tofu:       ~ description              = "SIP" -> "TLS"
15:50:07.221 STDOUT tofu:       ~ from_port                = 5060 -> 5443 # forces replacement
15:50:07.221 STDOUT tofu:       ~ id                       = "sgrule-3321342910" -> (known after apply)
15:50:07.221 STDOUT tofu:       ~ security_group_rule_id   = "sgr-0187a93d126f2ab5d" -> (known after apply)
15:50:07.221 STDOUT tofu:       + source_security_group_id = (known after apply)
15:50:07.221 STDOUT tofu:       ~ to_port                  = 5060 -> 5443 # forces replacement
15:50:07.221 STDOUT tofu:         # (5 unchanged attributes hidden)
15:50:07.221 STDOUT tofu:     }
15:50:07.221 STDOUT tofu:   # module.wrapper["test-sg"].aws_security_group_rule.ingress_with_cidr_blocks[7] must be replaced
15:50:07.221 STDOUT tofu: -/+ resource "aws_security_group_rule" "ingress_with_cidr_blocks" {
15:50:07.221 STDOUT tofu:       ~ cidr_blocks              = [ # forces replacement
15:50:07.221 STDOUT tofu:           - "10.0.0.0/16",
15:50:07.221 STDOUT tofu:           + "0.0.0.0/0",
15:50:07.221 STDOUT tofu:         ]
15:50:07.221 STDOUT tofu:       ~ description              = "App 5080" -> "Ingress Rule"
15:50:07.221 STDOUT tofu:       ~ from_port                = 5080 -> 5066 # forces replacement
15:50:07.221 STDOUT tofu:       ~ id                       = "sgrule-293012376" -> (known after apply)
15:50:07.221 STDOUT tofu:       ~ security_group_rule_id   = "sgr-05915f5821318557a" -> (known after apply)
15:50:07.221 STDOUT tofu:       + source_security_group_id = (known after apply)
15:50:07.221 STDOUT tofu:       ~ to_port                  = 5080 -> 5066 # forces replacement
15:50:07.221 STDOUT tofu:         # (5 unchanged attributes hidden)
15:50:07.221 STDOUT tofu:     }
15:50:07.221 STDOUT tofu:   # module.wrapper["test-sg"].aws_security_group_rule.ingress_with_cidr_blocks[8] must be replaced
15:50:07.222 STDOUT tofu: -/+ resource "aws_security_group_rule" "ingress_with_cidr_blocks" {
15:50:07.222 STDOUT tofu:       ~ cidr_blocks              = [ # forces replacement
15:50:07.222 STDOUT tofu:           - "10.0.0.0/16",
15:50:07.222 STDOUT tofu:           + "0.0.0.0/0",
15:50:07.222 STDOUT tofu:         ]
15:50:07.222 STDOUT tofu:       ~ description              = "Node Exporter" -> "RTP media"
15:50:07.222 STDOUT tofu:       ~ from_port                = 9100 -> 50000 # forces replacement
15:50:07.222 STDOUT tofu:       ~ id                       = "sgrule-2474565874" -> (known after apply)
15:50:07.222 STDOUT tofu:       ~ protocol                 = "tcp" -> "udp" # forces replacement
15:50:07.222 STDOUT tofu:       ~ security_group_rule_id   = "sgr-0d46bf4140aa48081" -> (known after apply)
15:50:07.222 STDOUT tofu:       + source_security_group_id = (known after apply)
15:50:07.222 STDOUT tofu:       ~ to_port                  = 9100 -> 60000 # forces replacement
15:50:07.222 STDOUT tofu:         # (4 unchanged attributes hidden)
15:50:07.222 STDOUT tofu:     }
15:50:07.222 STDOUT tofu: Plan: 9 to add, 0 to change, 9 to destroy.
15:50:07.222 STDOUT tofu: 
15:50:07.222 STDOUT tofu: Do you want to perform these actions?
15:50:07.222 STDOUT tofu:   OpenTofu will perform the actions described above.
15:50:07.222 STDOUT tofu:   Only 'yes' will be accepted to approve.
15:50:07.222 STDOUT tofu:   Enter a value: 
yes
15:50:10.735 STDOUT tofu: module.wrapper["test-sg"].aws_security_group_rule.ingress_with_cidr_blocks[0]: Destroying... [id=sgrule-2663506971]
15:50:10.735 STDOUT tofu: module.wrapper["test-sg"].aws_security_group_rule.ingress_with_cidr_blocks[4]: Destroying... [id=sgrule-820109638]
15:50:10.736 STDOUT tofu: module.wrapper["test-sg"].aws_security_group_rule.ingress_with_cidr_blocks[5]: Destroying... [id=sgrule-3642470144]
15:50:10.736 STDOUT tofu: module.wrapper["test-sg"].aws_security_group_rule.ingress_with_cidr_blocks[8]: Destroying... [id=sgrule-2474565874]
15:50:10.736 STDOUT tofu: module.wrapper["test-sg"].aws_security_group_rule.ingress_with_cidr_blocks[1]: Destroying... [id=sgrule-247681733]
15:50:10.736 STDOUT tofu: module.wrapper["test-sg"].aws_security_group_rule.ingress_with_cidr_blocks[6]: Destroying... [id=sgrule-3321342910]
15:50:10.736 STDOUT tofu: module.wrapper["test-sg"].aws_security_group_rule.ingress_with_cidr_blocks[7]: Destroying... [id=sgrule-293012376]
15:50:10.736 STDOUT tofu: module.wrapper["test-sg"].aws_security_group_rule.ingress_with_cidr_blocks[3]: Destroying... [id=sgrule-975564094]
15:50:10.736 STDOUT tofu: module.wrapper["test-sg"].aws_security_group_rule.ingress_with_cidr_blocks[2]: Destroying... [id=sgrule-723896223]
15:50:11.048 STDOUT tofu: module.wrapper["test-sg"].aws_security_group_rule.ingress_with_cidr_blocks[2]: Destruction complete after 0s
15:50:11.052 STDOUT tofu: module.wrapper["test-sg"].aws_security_group_rule.ingress_with_cidr_blocks[2]: Creating...
15:50:11.349 STDOUT tofu: module.wrapper["test-sg"].aws_security_group_rule.ingress_with_cidr_blocks[5]: Destruction complete after 0s
15:50:11.353 STDOUT tofu: module.wrapper["test-sg"].aws_security_group_rule.ingress_with_cidr_blocks[5]: Creating...
15:50:11.663 STDOUT tofu: module.wrapper["test-sg"].aws_security_group_rule.ingress_with_cidr_blocks[6]: Destruction complete after 1s
15:50:11.668 STDOUT tofu: module.wrapper["test-sg"].aws_security_group_rule.ingress_with_cidr_blocks[6]: Creating...
15:50:11.969 STDOUT tofu: module.wrapper["test-sg"].aws_security_group_rule.ingress_with_cidr_blocks[4]: Destruction complete after 1s
15:50:11.972 STDOUT tofu: module.wrapper["test-sg"].aws_security_group_rule.ingress_with_cidr_blocks[4]: Creating...
15:50:12.181 STDOUT tofu: module.wrapper["test-sg"].aws_security_group_rule.ingress_with_cidr_blocks[8]: Destruction complete after 1s
15:50:12.183 STDOUT tofu: module.wrapper["test-sg"].aws_security_group_rule.ingress_with_cidr_blocks[8]: Creating...
15:50:12.496 STDOUT tofu: module.wrapper["test-sg"].aws_security_group_rule.ingress_with_cidr_blocks[7]: Destruction complete after 1s
15:50:12.502 STDOUT tofu: module.wrapper["test-sg"].aws_security_group_rule.ingress_with_cidr_blocks[7]: Creating...
15:50:12.712 STDOUT tofu: module.wrapper["test-sg"].aws_security_group_rule.ingress_with_cidr_blocks[3]: Destruction complete after 2s
15:50:12.718 STDOUT tofu: module.wrapper["test-sg"].aws_security_group_rule.ingress_with_cidr_blocks[3]: Creating...
15:50:13.050 STDOUT tofu: module.wrapper["test-sg"].aws_security_group_rule.ingress_with_cidr_blocks[0]: Destruction complete after 2s
15:50:13.056 STDOUT tofu: module.wrapper["test-sg"].aws_security_group_rule.ingress_with_cidr_blocks[0]: Creating...
15:50:13.351 STDOUT tofu: module.wrapper["test-sg"].aws_security_group_rule.ingress_with_cidr_blocks[1]: Destruction complete after 2s
15:50:13.356 STDOUT tofu: module.wrapper["test-sg"].aws_security_group_rule.ingress_with_cidr_blocks[1]: Creating...
15:50:13.736 STDOUT tofu: module.wrapper["test-sg"].aws_security_group_rule.ingress_with_cidr_blocks[2]: Creation complete after 3s [id=sgrule-3321342910]
15:50:14.095 STDOUT tofu: module.wrapper["test-sg"].aws_security_group_rule.ingress_with_cidr_blocks[5]: Creation complete after 3s [id=sgrule-2663506971]
15:50:14.430 STDOUT tofu: module.wrapper["test-sg"].aws_security_group_rule.ingress_with_cidr_blocks[6]: Creation complete after 2s [id=sgrule-247681733]
15:50:15.212 STDOUT tofu: module.wrapper["test-sg"].aws_security_group_rule.ingress_with_cidr_blocks[7]: Creation complete after 2s [id=sgrule-723896223]
15:50:15.776 STDOUT tofu: module.wrapper["test-sg"].aws_security_group_rule.ingress_with_cidr_blocks[3]: Creation complete after 3s [id=sgrule-293012376]
15:50:16.126 STDOUT tofu: module.wrapper["test-sg"].aws_security_group_rule.ingress_with_cidr_blocks[0]: Creation complete after 3s [id=sgrule-820109638]
15:50:16.463 STDOUT tofu: module.wrapper["test-sg"].aws_security_group_rule.ingress_with_cidr_blocks[1]: Creation complete after 3s [id=sgrule-3642470144]
15:50:16.646 STDERR tofu: ╷
15:50:16.646 STDERR tofu: │ Error: [WARN] A duplicate Security Group rule was found on (sg-095d0eaa468da446d). This may be
15:50:16.646 STDERR tofu: │ a side effect of a now-fixed Terraform issue causing two security groups with
15:50:16.646 STDERR tofu: │ identical attributes but different source_security_group_ids to overwrite each
15:50:16.646 STDERR tofu: │ other in the state. See https://github.com/hashicorp/terraform/pull/2376 for more
15:50:16.646 STDERR tofu: │ information and instructions for recovery. Error: operation error EC2: AuthorizeSecurityGroupIngress, https response error StatusCode: 400, RequestID: fa8ca66b-9160-4fdc-89b0-e4481fc2826f, api error InvalidPermission.Duplicate: the specified rule "peer: 10.0.0.0/16, TCP, from port: 9100, to port: 9100, ALLOW" already exists
15:50:16.646 STDERR tofu: │ 
15:50:16.646 STDERR tofu: │   with module.wrapper["test-sg"].aws_security_group_rule.ingress_with_cidr_blocks[4],
15:50:16.646 STDERR tofu: │   on ../main.tf line 191, in resource "aws_security_group_rule" "ingress_with_cidr_blocks":
15:50:16.646 STDERR tofu: │  191: resource "aws_security_group_rule" "ingress_with_cidr_blocks" {
15:50:16.646 STDERR tofu: │ 
15:50:16.646 STDERR tofu: ╵
15:50:16.653 STDERR tofu: ╷
15:50:16.653 STDERR tofu: │ Error: [WARN] A duplicate Security Group rule was found on (sg-095d0eaa468da446d). This may be
15:50:16.653 STDERR tofu: │ a side effect of a now-fixed Terraform issue causing two security groups with
15:50:16.653 STDERR tofu: │ identical attributes but different source_security_group_ids to overwrite each
15:50:16.653 STDERR tofu: │ other in the state. See https://github.com/hashicorp/terraform/pull/2376 for more
15:50:16.653 STDERR tofu: │ information and instructions for recovery. Error: operation error EC2: AuthorizeSecurityGroupIngress, https response error StatusCode: 400, RequestID: a009d8d2-ec0a-4eff-9d53-07e674c41ec8, api error InvalidPermission.Duplicate: the specified rule "peer: 0.0.0.0/0, UDP, from port: 50000, to port: 60000, ALLOW" already exists
15:50:16.654 STDERR tofu: │ 
15:50:16.654 STDERR tofu: │   with module.wrapper["test-sg"].aws_security_group_rule.ingress_with_cidr_blocks[8],
15:50:16.654 STDERR tofu: │   on ../main.tf line 191, in resource "aws_security_group_rule" "ingress_with_cidr_blocks":
15:50:16.654 STDERR tofu: │  191: resource "aws_security_group_rule" "ingress_with_cidr_blocks" {
15:50:16.654 STDERR tofu: │ 
15:50:16.654 STDERR tofu: ╵
15:50:16.731 ERROR  tofu invocation failed in ./.terragrunt-cache/p3sluMEygAuEnYFSQUxBtEsScSI/xiaRMVJQ7u1QcnX4uRWzVu02LlQ/wrappers
15:50:16.732 ERROR  error occurred:

* Failed to execute "tofu apply" in ./.terragrunt-cache/p3sluMEygAuEnYFSQUxBtEsScSI/xiaRMVJQ7u1QcnX4uRWzVu02LlQ/wrappers
  ╷
  │ Error: [WARN] A duplicate Security Group rule was found on (sg-095d0eaa468da446d). This may be
  │ a side effect of a now-fixed Terraform issue causing two security groups with
  │ identical attributes but different source_security_group_ids to overwrite each
  │ other in the state. See https://github.com/hashicorp/terraform/pull/2376 for more
  │ information and instructions for recovery. Error: operation error EC2: AuthorizeSecurityGroupIngress, https response error StatusCode: 400, RequestID: fa8ca66b-9160-4fdc-89b0-e4481fc2826f, api error InvalidPermission.Duplicate: the specified rule "peer: 10.0.0.0/16, TCP, from port: 9100, to port: 9100, ALLOW" already exists
  │ 
  │   with module.wrapper["test-sg"].aws_security_group_rule.ingress_with_cidr_blocks[4],
  │   on ../main.tf line 191, in resource "aws_security_group_rule" "ingress_with_cidr_blocks":
  │  191: resource "aws_security_group_rule" "ingress_with_cidr_blocks" {
  │ 
  ╵
  ╷
  │ Error: [WARN] A duplicate Security Group rule was found on (sg-095d0eaa468da446d). This may be
  │ a side effect of a now-fixed Terraform issue causing two security groups with
  │ identical attributes but different source_security_group_ids to overwrite each
  │ other in the state. See https://github.com/hashicorp/terraform/pull/2376 for more
  │ information and instructions for recovery. Error: operation error EC2: AuthorizeSecurityGroupIngress, https response error StatusCode: 400, RequestID: a009d8d2-ec0a-4eff-9d53-07e674c41ec8, api error InvalidPermission.Duplicate: the specified rule "peer: 0.0.0.0/0, UDP, from port: 50000, to port: 60000, ALLOW" already exists
  │ 
  │   with module.wrapper["test-sg"].aws_security_group_rule.ingress_with_cidr_blocks[8],
  │   on ../main.tf line 191, in resource "aws_security_group_rule" "ingress_with_cidr_blocks":
  │  191: resource "aws_security_group_rule" "ingress_with_cidr_blocks" {
  │ 
  ╵
  
  exit status 1
```
</details>
